Repository: yamarten/atproto-website
Catalog: translation/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: An issue occurred starting the chat
ja: チャットの開始時に問題が発生しました

source: An issue occurred while trying to open the chat
ja: チャットを開始しようとした時に問題が発生しました

source: An issue occurred, please try again.
ja: 問題が発生しました。もう一度お試しください。

source: An mockup of a iPhone showing the Bluesky app open to the profile of a verified user with a blue checkmark next to their display name.
ja: Blueskyアプリが表示されているiPhoneのモックアップで、認証されたユーザーのプロフィールを開くと、表示名の横に青色のチェックマークが表示されています。

source: And (one hopes) that this network continues to scale: not just to add capacity, but to create a wider variety of applications sharing in this open applications network.
ja: そして、このネットワークが拡張され続けることを願っています。容量を増やすだけでなく、このオープンアプリケーションネットワークで共有されるアプリケーションの多様性を高めるためです。

source: And eventually publish it with `goat lex publish`:
ja: 最後に`goat lex publish`で公開します。

source: And finally, update the `stateStore:` and `sessionStore` code blocks in `lib/auth/client.ts` to use the database. You'll need to import `getDb` at the top too:
ja: 最後に、`lib/auth/client.ts`の`stateStore:`と`sessionStore`のコードをデータベース用に更新します。先頭で`getDb`のimportも必要です。

source: And here are some example record types:
ja: レコード型の例を以下に示します。

source: And here we are!
ja: するとこうなります。

source: And we approach the design of this network erring on the side of structure and hoping to take advantage of high-trust environments where possible, but always allowing for credible exit if that relationship turns sour.
ja: そして、このネットワークの設計においては構造を重視し、可能な限り高信頼環境の利点を活かしつつ、その関係が悪化した場合のために信頼できる出口を常に確保します。

source: And, finally, replace the starter `app/page.tsx` to use these components and show the user's DID when logged in:
ja: 最後に、スターターの`app/page.tsx`を置き換えてこれらのコンポーネントを使い、ログイン時にユーザーDIDを表示します。

source: Animal sexual abuse
ja: 動物の性的虐待

source: Animal welfare
ja: 動物の福祉

source: Animals
ja: 動物

source: Animated GIF
ja: アニメーションGIF

source: Announcement
ja: お知らせ

source: Announcing verification on Bluesky
ja: Blueskyでの認証のお知らせ

source: Another major reason is scalability. ActivityPub depends heavily on delivering messages between a wide network of small-to-medium sized nodes, which can cause individual nodes to be flooded with traffic and generally struggles to provide global views of activity. The AT Protocol uses aggregating applications to merge activity from the users' hosts, reducing the overall traffic and dramatically reducing the load on individual hosts.
ja: もう一つの大きな理由は、スケーラビリティです。ActivityPubは、小規模から中規模のノードの広範なネットワーク間でメッセージを配信することに大きく依存しているため、個々のノードにトラフィックが殺到し、アクティビティのグローバルビューを提供するのが困難になることがあります。ATプロトコルは、集約アプリケーションを使用してユーザーのホストからのアクティビティをマージし、全体的なトラフィックを削減して、個々のホストの負荷を大幅に削減します。

source: Anybody can create a new schema using the [Lexicon](https://atproto.com/specs/lexicon) language, which is very similar to [JSON-Schema](http://json-schema.org/). The schemas use [reverse-DNS IDs](https://atproto.com/specs/nsid) which indicate ownership. In this demo app we're going to use `xyz.statusphere` which we registered specifically for this project (aka statusphere.xyz).
ja: [JSON-Schema](http://json-schema.org/)に非常によく似た[Lexicon](https://atproto.com/specs/lexicon)言語を使用して、誰でも新しいスキーマを作成できます。スキーマは、所有権を示す[逆DNS ID](https://atproto.com/specs/nsid)を使用します。このデモアプリでは、このプロジェクト専用に登録した`xyz.statusphere`（別名statusphere.xyz）を使用します。

source: Anyone
ja: 誰でも

source: Anyone can connect to the firehose without authentication — this is a core feature of the protocol. To get started, open a WebSocket connection to any provider of the `com.atproto.sync.subscribeRepos` endpoint:
ja: 誰でも認証なしでfirehoseに接続できます。これはプロトコルのコア機能です。開始するには、`com.atproto.sync.subscribeRepos`エンドポイントのプロバイダーへのWebSocket接続を開きます。

source: Anyone can interact
ja: 誰でも反応可能

source: Anyone who follows me
ja: フォローしている人

source: App Icon
ja: アプリアイコン

source: App Language
ja: アプリの言語

source: App Password
ja: アプリパスワード

source: App Passwords
ja: アプリパスワード

source: App Views and Relays are both application-level tooling, rather than inherent parts of the AT protocol. Our App View implementation responds to [XRPC](/specs/xrpc) calls — our HTTP API.
ja: AppViewとリレーはいずれもATプロトコルに固有の部品ではなく、アプリケーションレベルのツールです。私たちのAppView実装は[XRPC](/specs/xrpc)呼び出し（私たちのHTTP API）に応答します。

source: App Views provide aggregated application data for the entire network. They support large-scale metrics (likes, reposts, followers), content discovery (algorithms), and user search.
ja: AppViewはネットワーク全体のアプリケーションデータの集計値を提供します。広域的な指標（いいね数、リポスト数、フォロワー数）やコンテンツ発見（アルゴリズム）、ユーザー検索に対応します。

source: App language
ja: アプリの言語

source: App password deleted
ja: アプリパスワードを削除しました

source: App password name must be unique
ja: アプリパスワードの名前はすでにあるものと異なるようにしなくてはなりません

source: App password names can only contain letters, numbers, spaces, dashes, and underscores
ja: アプリパスワードの名前には、英数字、スペース、ハイフン、アンダースコアのみが使用可能です

source: App password names must be at least 4 characters long
ja: アプリパスワードの名前は長さが4文字以上である必要があります

source: App passwords
ja: アプリパスワード

source: AppViews function a bit like search engines on the Web: they aggregate data from across the Atmosphere to produce their UIs. The difference is that AppViews also communicate with users' [PDSes](#pds) to publish information on their [repos](#data-repo), forming the full application model. This communication is established as a part of the OAuth login flow.
ja: AppViewはウェブ上の検索エンジンに少し似ています。Atmosphere全体からデータを集約してUIを生成します。違いは、AppViewがユーザーの[PDS](#pds)とも通信して[リポジトリ](#data-repo)に情報を公開し、完全なアプリケーションモデルを形成することです。この通信は、OAuthログインフローの一部として確立されます。

source: Appeal
ja: 異議を申し立てる

source: Appeal "{0}" label
ja: 「{0}」のラベルに異議を申し立てる

source: Appeal Suspension
ja: アカウント停止に異議申し立て

source: Appeal submitted
ja: 異議申し立てを送信しました

source: Appeal suspension
ja: アカウント停止に異議申し立て

source: Appeal this decision
ja: この決定に異議を申し立てる

source: Appearance
ja: 外観

source: Applications with an end user login flow should use [OAuth](/guides/auth) authentication rather than app password sessions. Password auth is acceptable for bots and command line tools. Both methods will produce the same authenticated `agent`.
ja: エンドユーザーログインフローを備えるアプリケーションは、アプリパスワードセッションではなく[OAuth](/guides/auth)認証を使用しましょう。パスワード認証はボットやコマンドラインツールに適しています。どちらの方法でも同じ認証済み`agent`が生成されます。

source: Applications with an end user login flow should use [OAuth](/guides/auth) authentication rather than app password sessions. Password auth is acceptable for bots and command line tools. Both methods will produce the same authenticated `agent`. </TabPanel> <TabPanel value="go"> Start by importing the `atproto` and `xrpc` libraries, creating an `&xrpc.Client{}`, and providing credentials to call `ServerCreateSession()`:
ja: エンドユーザーログインフローを備えるアプリケーションは、アプリパスワードセッションではなく[OAuth](/guides/auth)認証を使用しましょう。パスワード認証はボットやコマンドラインツールに適しています。どちらの方法でも同じ認証済み`agent`が生成されます。 </TabPanel> <TabPanel value="go"> `atproto`と`xrpc`ライブラリをインポートし、`&xrpc.Client{}`を作って`ServerCreateSession()`に資格情報を与えるところから始めましょう。

source: Applications write to the repo. The write events are then emitted on the firehose where they're caught by the apps and ingested into their databases.
ja: アプリケーションはリポジトリに書き込みます。書き込みイベントはその後、firehoseに発行され、アプリによってキャッチされてデータベースに取り込まれます。

source: Apply Pull Request
ja: プルリクエストを適用

source: Apply default recommended feeds
ja: デフォルトのおすすめフィードを追加

source: Apps that are using ATProto identity providers *solely* for authentication [only need to request the `atproto` permission](/guides/scopes). This provides the same OAuth flow that you might expect from other identity providers; no features of the Atmosphere social graph are used, and no additional permissions are required:
ja: ATProtoのIDプロバイダーを認証*のみ*に利用するアプリは、[`atproto`権限を要求するだけで十分](/guides/scopes)です。これにより、他のIDプロバイダーで期待するのと同じOAuthフローが提供されます。Atmosphereのソーシャルグラフ機能は使われず、追加の権限も不要です。

source: Apps that are using Atproto identity providers *solely* for authentication [only need to request the `atproto` permission](/guides/scopes). This provides the same OAuth flow that you might expect from other identity providers; no features of the Atmosphere social graph are used, and no additional permissions are required:
ja: atprotoのIDプロバイダーを認証*のみ*に利用するアプリは、[`atproto`権限を要求するだけで十分](/guides/scopes)です。これにより、他のIDプロバイダーで期待するのと同じOAuthフローが提供されます。Atmosphereのソーシャルグラフ機能は使われず、追加の権限も不要です。

source: Archived from {0}
ja: {0}のアーカイブ

source: Archived post
ja: アーカイブ投稿

source: Are you sure you want to delete the app password "{0}"?
ja: アプリパスワード「{0}」を本当に削除しますか？

source: Are you sure you want to delete this message? The message will be deleted for you, but not for the other participant.
ja: このメッセージを本当に削除しますか？このメッセージはあなたからは削除したように見えますが、他の参加者からは削除されません。

source: Are you sure you want to delete this starter pack?
ja: 本当にこのスターターパックを削除したいですか？

source: Are you sure you want to discard your changes?
ja: 本当に変更を破棄したいですか？

source: Are you sure you want to leave this conversation?
ja: 本当にこの会話を終了しますか？

source: Are you sure you want to leave this conversation? Your messages will be deleted for you, but not for the other participant.
ja: この会話から退出しますか？あなたのメッセージはあなたからは削除したように見えますが、他の参加者からは削除されません。

source: Are you sure you want to remove this from your feeds?
ja: 本当にこのフィードをあなたのフィードから削除したいですか？

source: Are you sure you'd like to discard this draft?
ja: 本当にこの下書きを削除しますか？

source: Are you sure you'd like to discard this post?
ja: 本当にこの投稿を削除しますか？

source: Are you sure?
ja: 本当によろしいですか？

source: Are you writing in <0>{suggestedLanguageName}</0>?
ja: <0>{suggestedLanguageName}</0>で書かれた投稿ですか？

source: Art
ja: アート

source: Artistic or non-erotic nudity.
ja: 芸術的または性的ではないヌード。

source: As `tap` discovers posts from the network, this feed server will search their text for our configured search terms. If it finds a match, it'll add the post to your array. Add the following contents to `src/index.ts`:
ja: `tap`がネットワーク上の投稿を検出すると、このフィードサーバーは投稿テキストを設定した検索語で検索します。一致した場合は投稿を配列に追加します。以下の内容を`src/index.ts`に追加してください。

source: As a developer, you can request limited access to a person's account, meaning if you only need to post a message to someone's public timeline, you don't also need to request access to read their private messages. This is great for your app because you don't have to worry about managing data you don't need, and it's great for the person using your app because they don't need to worry about their DMs being compromised.
ja: 開発者からすると、個人のアカウントへの限定的なアクセスをリクエストできます。つまり、誰かのパブリックタイムラインにメッセージを投稿するだけでよい場合、プライベートメッセージの閲覧まで要求する必要はありません。これはあなたのアプリケーションにとって素晴らしいことです。なぜなら、必要のないデータを管理することについて心配する必要がないからです。また、あなたのアプリケーションを使う人にとっても素晴らしいことです。なぜなら、DMが漏洩することについて心配する必要がないからです。

source: As a final optimization, let's introduce "optimistic updates."
ja: 最後の最適化として、楽観的更新を導入しましょう。

source: As our application grows, we hit some performance limits so we toss some caches into the stack.
ja: アプリケーションが大きくなるにつれて、パフォーマンスの限界に達するため、スタックにキャッシュをいくつか投入します。

source: As well, unlike p2p networks, users maintain a relationship with a persistent backend (the PDS) that hosts their data and information about their identity. Most notably (while not a hard requirement in atproto), we made the decision to move signing keys up to the backend. This prevents the complex key management UX issues that come with client-side keys. However, there is an obvious loss in user-control by doing so. This is mitigated once again by lazy trust. Trust is moved a layer up into the identity system such that a user can hold a recovery key for their identity that allows them to migrate away from a bad PDS.
ja: また、P2Pネットワークと異なり、ユーザーは自分のデータとID情報をホストする永続的なバックエンド（PDS）と関係を持ちます。特に（atprotoで厳密に必須というわけではありませんが）、私たちは署名鍵をバックエンド側へ移す決定をしました。これにより、クライアントが鍵を持つことによる複雑な鍵管理UXの問題を防げます。しかし、その分ユーザーのコントロールが失われるのも事実です。これも後回し信頼で緩和されます。信頼はIDシステムの一段上に移され、ユーザーはIDの復旧鍵を保持でき、それによって不適切なPDSから移行できます。

source: As with Web search engines, users are free to select their aggregators. Feeds, labelers, and search indices can be provided by independent third parties, with requests routed by the PDS, based on client app configuration. Client apps may be tied to specific services, such as App Views or mandatory labelers.
ja: ウェブ検索エンジンと同様に、ユーザーはアグリゲータを自由に選択できます。フィード、ラベラー、検索インデックスは独立したサードパーティによって提供され、リクエストはクライアント設定に基づいてPDSによってルーティングされます。クライアントアプリは、AppViewや必須ラベラーなど特定のサービスに紐付けられている場合があります。

source: As with Web search engines, users are free to select their aggregators. Feeds, search indices, and entire app views can be provided by independent third parties, with requests routed by the PDS based on user configuration.
ja: ウェブ検索エンジンがそうであるように、ユーザーはアグリゲーターを自由に選べます。フィード、検索インデックス、そしてアプリビュー全体を独立した第三者が提供でき、リクエストはユーザー設定に基づきPDSによってルーティングされます。

source: As with an authenticated client, you can `.get()` any public records, like a user's profile:
ja: 認証済みクライアントと同様に、ユーザープロフィールなどの公開レコードを`.get()`できます。

source: Assign topic for algo
ja: アルゴリズム用にトピックを割り当て

source: At any stage of migration, the authenticated `com.atproto.server.checkAccountStatus` endpoint can be called on either the old or new PDS instance to check statistics about currently indexed data.
ja: 移行中の任意の段階で、認証付きで`com.atproto.server.checkAccountStatus`エンドポイントを旧PDSまたは新PDSで呼び出し、現在インデックスされているデータの統計を確認できます。

source: At first, all we know is `alice.pds.com`, so we look up the DNS TXT record `_atproto.alice.pds.com`. This tells us the DID: `did:plc:12345`.
ja: まず、わかっているのは`alice.pds.com`なので、`_atproto.alice.pds.com`のDNS TXTレコードを見てみます。これにより、DIDが`did:plc:12345`であるとわかります。

source: At least 8 characters
ja: 少なくとも8文字

source: At this point the migration is complete. New content can be published by writing to the repo, preferences can be updated, and inter-service auth and proxying should work as expected. It may be necessary to log out of any clients and log back in. In some cases, if services have aggressive identity caching and do not refresh on signature failure, service auth requests could fail for up to 24 hours.
ja: この時点で移行は完了です。リポジトリへ書き込むことで新しいコンテンツを公開でき、設定の更新やサービス間認証、プロキシも期待通り動作するはずです。クライアントからログアウトして再ログインする必要があるかもしれません。場合によっては、サービスの積極的なIDキャッシュが署名失敗でもリフレッシュされず、サービス認証が最大で24時間失敗する可能性があります。

source: At this point, the user is still able to authenticate to both PDS instances. The new PDS knows that it is current for the account, but still has the account marked as "deactivated". The old PDS may not realize that it is no longer current.
ja: この時点ではユーザーは両方のPDSインスタンスに認証可能です。新PDSはアカウントの現行であることを認識していますが、アカウントはまだ無効化されたままです。旧PDSはもはや現行でないことに気づかない可能性があります。

source: At this point, you should be able to test the OAuth flow!
ja: この時点でOAuthフローをテストできるはずです。

source: Atmosphere HTTP API methods each scope and implement a particular set of Lexicons. The AT Protocol's API system, [XRPC](/specs/xrpc), is essentially a thin wrapper around HTTPS. For example, a call to:
ja: AtmosphereのHTTP APIメソッドは、それぞれ特定のLexiconセットに対して実装します。ATプロトコルのAPIシステムである[XRPC](/specs/xrpc)は、本質的にHTTPSの薄いラッパーです。例えば、次の呼び出しは、

source: Atproto HTTP API methods each scope and implement a particular set of Lexicons. The AT Protocol's API system, [XRPC](/specs/xrpc), is essentially a thin wrapper around HTTPS. For example, a call to:
ja: atprotoのHTTP APIメソッドは、それぞれ特定のLexiconセットに対して実装します。ATプロトコルのAPIシステムである[XRPC](/specs/xrpc)は、本質的にHTTPSの薄いラッパーです。例えば、次の呼び出しを考えます。

source: Atproto HTTP API methods each scope and implement a particular set of [Lexicons](/guides/lexicon). For example, an app using the `app.bsky.feed.post` record type would be expected to also implement an application endpoint like `curl -X POST example.com/xrpc/app.bsky.feed.post -d {post-contents}`.
ja: atprotoのHTTP APIメソッドは、それぞれ特定のLexiconセットに対して実装します。例えば、`app.bsky.feed.post`レコードを使用するアプリは、`curl -X POST example.com/xrpc/app.bsky.feed.post -d {post-contents}` のようなアプリケーションエンドポイントも実装することが期待されます。

source: Atproto [specifies](/specs/oauth) a particular "profile" of the OAuth standards, using [OAuth 2.1](https://www.ietf.org/archive/id/draft-ietf-oauth-v2-1-13.html) as the foundation.
ja: atprotoは[OAuth仕様](/specs/oauth)でOAuth標準の特定のプロファイルを指定し、[OAuth 2.1](https://www.ietf.org/archive/id/draft-ietf-oauth-v2-1-13.html)を基礎としています。

source: Atproto exchanges data and RPC commands across organizations. For the data and RPC to be useful, the software needs to correctly handle schemas created by separate teams. This is the purpose of [Lexicon](/guides/lexicon).
ja: atprotoは組織間でデータとRPCコマンドを交換します。データとRPCが有用であるためには、ソフトウェアが別のチームによって作成されたスキーマを正しく処理する必要があります。これが[Lexicon](/guides/lexicon)の目的です。

source: Atproto is a multi-party, low-coordination network. Services can join permissionlessly and operate under their own policies. While coordination pains are to some degree inevitable, atproto tries to head off the worst of it by being a very structured protocol. You'll see this reflected in many design decisions in the protocol: records encoded as canonical cbor, multiformats everywhere, a unicit (deterministic insertion-order-independent construction) data structure in the repository, a constrained set of allowed dids/hash functions, even things like requiring DPoP in OAuth.
ja: atprotoは多者間・低調整のネットワークです。サービスは許可不要で参加し、それぞれのポリシーで運用できます。調整の痛みはある程度避けられませんが、atprotoは非常に構造化されたプロトコルであることで、最悪の事態を避けようとしています。これはプロトコルの多くの設計判断に反映されています。例えば、正規化CBORでエンコードされたレコード、至る所に現れるmultiformats、unicit（挿入順序に依存しない決定的構成）なデータ構造を持つリポジトリ、許可されたDID/ハッシュ関数の制限、さらにはOAuthでDPoPを要求することなどです。

source: Atproto is big-world, open social. Users publish JSON records into repositories. The changestreams of those records then sync across the network to drive applications.
ja: atprotoは、ビッグワールドでオープンなソーシャルです。ユーザーはJSONレコードをリポジトリに公開します。これらのレコードの変更ストリームがネットワーク全体で同期され、アプリケーションを動かします。

source: Atproto takes a middle approach that we sometimes refer to as “lazy trust”. Like p2p networks, trust is imbued into the data. However most often when browsing the network, users are seeing computed views not the canonical data. When viewing a timeline for instance, clients are likely not checking the signatures on every post that comes down. This is mitigated by the fact that the canonical data is always at hand. Therefore the service that offers these computed views is *staking its reputation* on every view that it serves. If a service starts serving invalid views, this can be verifiably proven. And since the data is locked open, users can migrate to another service that is better behaved.
ja: atprotoは中間的なアプローチを取り、私たちはこれを「後回し信頼（lazy trust）」と呼ぶことがあります。P2Pネットワークと同様に、信頼はデータに埋め込まれています。しかし、ネットワークを閲覧する際にユーザーが見るのは多くの場合、正規データではなく計算済みのビューです。例えばタイムラインを見るとき、クライアントは流れてくるすべての投稿の署名を検証しないでしょう。これは、正規データが常に手元にあることで緩和されます。したがって、これらの計算済みビューを提供するサービスは、提供するすべてのビューに*評判を賭けて*います。サービスが無効なビューを出し始めたら、それを検証できます。しかもデータはオープンなので、ユーザーはより適切な別サービスへ移行できます。

source: Aurora
ja: オーロラ

source: Autoplay videos and GIFs
ja: ビデオとGIFの自動再生

source: Available
ja: 利用可能

source: Avoid conflicts and confusion between groups, names, and definitions
ja: グループ、名前、および定義間の競合や混同を避けてください

source: Avoid generic names which conflict with popular programming language conventions
ja: 一般的なプログラミング言語の慣例と衝突する一般的な名前を避けてください

source: Back
ja: 戻る

source: Back to Chats
ja: チャットへ戻る

source: Backfill services can enumerate all accounts in the network with the given signaling record, and also process deletion of that record as deactivation of that modality.
ja: バックフィルサービスは、指定されたシグナリングレコードを持つネットワーク内のすべてのアカウントを列挙し、そのレコードの削除を非アクティブ化として処理できます。

source: Backfilling is the process of syncing all the data in the network from scratch. You may want to do this if you're running a service that requires a complete copy of the data in the network. This is not generally necessary for running feed generators, labelers, or bots, as most of the time they are fine handling live data off of the firehose. However, backfilling may be of interest if you want to perform large-scale data analysis
ja: バックフィルは、ネットワーク内のすべてのデータをゼロから同期する処理です。ネットワーク内の全データの完全なコピーが必要なサービスを動かすなら、これを行いたい場合があるでしょう。フィードジェネレーター、ラベラー、またはボットを実行する場合、大抵はfirehoseからのライブデータだけで十分なため、これは一般に必要ありません。ただし、大規模なデータ分析を実行したい場合は、バックフィリングに関心を持つかもしれません。

source: Backfilling is the process of syncing all the data in the network from scratch. You may want to do this if you're running a service that requires a complete copy of the data in the network. This is not generally necessary for running feed generators, labelers, or bots, as most of the time they are fine handling live data off of the firehose. However, backfilling may be of interest if you want to perform large-scale data analysis.
ja: バックフィルは、ネットワーク内のすべてのデータをゼロから同期する処理です。ネットワーク内の全データの完全なコピーが必要なサービスを動かすなら、これを行いたい場合があるでしょう。フィードジェネレーター、ラベラー、またはボットを実行する場合、大抵はfirehoseからのライブデータだけで十分なため、これは一般に必要ありません。ただし、大規模なデータ分析を実行したい場合は、バックフィリングに関心を持つかもしれません。

source: Banned activities or security violations
ja: 禁止されたアクティビティまたはセキュリティ侵害

source: Banned user returning
ja: BANされたユーザーの帰還

source: Be careful not to get rate limited. You will be making one call to `getRepo` per user. It is recommended to implement client side rate limiting to prevent your requests from getting blocked by firewalls on the PDS or relay you are requesting data from.
ja: レート制限を受けないように注意してください。ユーザー毎に`getRepo`呼び出しを1回行うことになります。データをリクエストされるPDSまたはリレーのファイアウォールによってリクエストがブロックされるのを防ぐために、クライアント側のレート制限を実装することをお勧めします。

source: Bear in mind that firehose output format is one of the more complex parts of AT, involving decoding binary [CBOR](/specs/data-model) data and [CAR](/specs/repository#car-file-serialization) files. Additionally, the volume of data has increased rapidly as the network has grown. The full synchronization firehose is core network infrastructure, but for end users such as [feed developers](/guides/feeds), we provide an alternative streaming solution called **Jetstream.**
ja: firehose出力形式はATの特に複雑な部分の一つであり、バイナリ[CBOR](/specs/data-model)データと[CAR](/specs/repository#car-file-serialization)ファイルのデコードが含まれることに注意してください。さらに、ネットワークが成長するにつれてデータの量は急速に増加しています。完全な同期firehoseはコアネットワークインフラストラクチャですが、[フィード開発者](/guides/feeds)などのエンドユーザーのために、**Jetstream**という代替ストリーミングソリューションを提供しています。

source: Because AT uses regular HTTP verbs and HTTP endpoints, you can also follow this guide by using a CLI tool like cURL to make HTTP requests following the [HTTP Reference](https://docs.bsky.app/docs/category/http-reference) endpoints. Most users will want to use an SDK.
ja: ATは通常のHTTPメソッドとエンドポイントを使用するため、cURLのようなCLIツールで[HTTPリファレンス](https://docs.bsky.app/docs/category/http-reference)に従ってHTTPリクエストを行うことでこのガイドに従うこともできます。ほとんどのユーザーはSDKを使用したいでしょう。

source: Because Feeds will provide their own XRPC endpoints, they should use the server SDKs:
ja: フィードは独自のXRPCエンドポイントを提供するためにサーバーSDKを使用する必要があります。

source: Because all AT Protocol records are openly available and addressible via an `at://` URI, this makes it possible to encode nested API queries into individual URLs. The community project [pds.ls](https://pdsls.dev/at://did:plc:vmt7o7y6titkqzzxav247zrn/app.bsky.feed.post/3mbaxebcd6s2f) does this, for example.
ja: ATプロトコルのレコードは全て誰でも取得可能で、`at://` URIで指定可能なため、これによりネストされたAPIクエリを個別のURLにエンコードできるようになります。一例として、コミュニティプロジェクト[pds.ls](https://pdsls.dev/at://did:plc:vmt7o7y6titkqzzxav247zrn/app.bsky.feed.post/3mbaxebcd6s2f)はこれを行います。

source: Because all AT Protocol records are openly available and addressible via an `at://` URI, this makes it possible to encode nested API queries into individual URLs. The community project [pdsls](https://pdsls.dev/at://did:plc:vmt7o7y6titkqzzxav247zrn/app.bsky.feed.post/3mbaxebcd6s2f) does this, for example.
ja: ATプロトコルのレコードは全て誰でも取得可能で、`at://` URIで指定可能なため、これによりネストされたAPIクエリを個別のURLにエンコードできるようになります。一例として、コミュニティプロジェクト[pdsls](https://pdsls.dev/at://did:plc:vmt7o7y6titkqzzxav247zrn/app.bsky.feed.post/3mbaxebcd6s2f)はこれを行います。
